
&НаКлиенте
Процедура ТоварыЦенаКоличествоПриИзменении(Элемент)
	
	РассчитатьСумму(); 
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСумму()
	
	ТекущаяСтрока = Объект.Товары[Элементы.Товары.ТекущаяСтрока];
	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Объект.Товары[Элементы.Товары.ТекущаяСтрока];
	
	ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ?(ТекущаяСтрока.Количество = 0, 1, ТекущаяСтрока.Количество);
	
КонецПроцедуры

